Tekla.Structures.Filtering.NumericConstantFilterExpression
The NumericConstantFilterExpression class represents a constant numeric filter expression.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(Tekla.Structures.TeklaStructuresDatabaseTypeEnum)
Initializes a new instance of the NumericConstantFilterExpression class.
ObjectType: The value to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{Tekla.Structures.TeklaStructuresDatabaseTypeEnum})
Initializes a new instance of the NumericConstantFilterExpression class.
ObjectTypes: The values to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Int16)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.Int16})
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The values to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.UInt16)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.UInt16})
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The values to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Int32)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.Int32})
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The  values to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.UInt32)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.UInt32})
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The values to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Int64)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.Int64})
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The values to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.UInt64)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.UInt64})
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The values to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Double)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.Double})
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The values to represent.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Int16,System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.Int16},System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The values to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.UInt16,System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.UInt16},System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The values to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Int32,System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.Int32},System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The values to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.UInt32,System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.UInt32},System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The values to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Int64,System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.Int64},System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The values to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.UInt64,System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.UInt64},System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The values to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Double,System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Value: The value to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.NumericConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.Double},System.IFormatProvider)
Initializes a new instance of the NumericConstantFilterExpression class.
Values: The value to represent.
Provider: An IFormatProvider object.